In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {"Name":["sachin",'lakshay','saurabh','abhishek'],
       "Branch":["cse",'it','ece','cse'],
       "college":['piet','jecrc','raffels','piet'],
       "roll_no":[10,20,30,50]}
data

{'Name': ['sachin', 'lakshay', 'saurabh', 'abhishek'],
 'Branch': ['cse', 'it', 'ece', 'cse'],
 'college': ['piet', 'jecrc', 'raffels', 'piet'],
 'roll_no': [10, 20, 30, 50]}

In [3]:
pd.DataFrame(data)

       Name Branch  college  roll_no
0    sachin    cse     piet       10
1   lakshay     it    jecrc       20
2   saurabh    ece  raffels       30
3  abhishek    cse     piet       50

In [5]:
df = pd.DataFrame(data)
df

       Name Branch  college  roll_no
0    sachin    cse     piet       10
1   lakshay     it    jecrc       20
2   saurabh    ece  raffels       30
3  abhishek    cse     piet       50

In [6]:
type(df)

pandas.core.frame.DataFrame

In [8]:
type(df['Name']) # series   #in a data frame single column calles a series

pandas.core.series.Series

In [9]:
df['Branch'] # to access a single column

0    cse
1     it
2    ece
3    cse
Name: Branch, dtype: object

In [12]:
df.Name

0      sachin
1     lakshay
2     saurabh
3    abhishek
Name: Name, dtype: object

In [13]:
df.roll_no

0    10
1    20
2    30
3    50
Name: roll_no, dtype: int64

In [15]:
df[['Name','roll_no']] # to access a multiple column

       Name  roll_no
0    sachin       10
1   lakshay       20
2   saurabh       30
3  abhishek       50

In [16]:
df[['Branch','roll_no']]

  Branch  roll_no
0    cse       10
1     it       20
2    ece       30
3    cse       50

In [17]:
df

       Name Branch  college  roll_no
0    sachin    cse     piet       10
1   lakshay     it    jecrc       20
2   saurabh    ece  raffels       30
3  abhishek    cse     piet       50

In [18]:
####___________FOR INDEXING IN DATAFRAME WE HAVE 2 METHOD :___________
#1.loc
#2.iloc

SyntaxError: invalid syntax (691121616.py, line 2)

In [19]:
df.iloc[2:4,2:4]

   college  roll_no
2  raffels       30
3     piet       50

In [20]:
df.iloc[-2:,-2:]

   college  roll_no
2  raffels       30
3     piet       50

In [21]:
df

       Name Branch  college  roll_no
0    sachin    cse     piet       10
1   lakshay     it    jecrc       20
2   saurabh    ece  raffels       30
3  abhishek    cse     piet       50

In [23]:
df.loc[0:2] # in loc method the ending / stoping point are include

      Name Branch  college  roll_no
0   sachin    cse     piet       10
1  lakshay     it    jecrc       20
2  saurabh    ece  raffels       30

In [24]:
df.iloc[1:3,:3]

      Name Branch  college
1  lakshay     it    jecrc
2  saurabh    ece  raffels

In [26]:
df.iloc[-3:-1,-4:-1]

      Name Branch  college
1  lakshay     it    jecrc
2  saurabh    ece  raffels

In [8]:
import pandas as pd

In [9]:
import warnings
warnings.filterwarnings('ignore')

In [10]:
file_path = r"C:\Users\Lenovo\Desktop\data science internship\\Used_Bikes.csv"
df = pd.read_csv(file_path)

In [11]:
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000,Ahmedabad,17654,First Owner,3,110,TVS
1,Royal Enfield Classic 350cc,119900,Delhi,11000,First Owner,4,350,Royal Enfield
2,Triumph Daytona 675R,600000,Delhi,110,First Owner,8,675,Triumph
3,TVS Apache RTR 180cc,65000,Bangalore,16329,First Owner,4,180,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000,Bangalore,10000,First Owner,3,150,Yamaha
...,...,...,...,...,...,...,...,...
32643,Hero Passion Pro 100cc,39000,Delhi,22000,First Owner,4,100,Hero
32644,TVS Apache RTR 180cc,30000,Karnal,6639,First Owner,9,180,TVS
32645,Bajaj Avenger Street 220,60000,Delhi,20373,First Owner,6,220,Bajaj
32646,Hero Super Splendor 125cc,15600,Jaipur,84186,First Owner,16,125,Hero
32647,Bajaj Pulsar 150cc,22000,Pune,60857,First Owner,13,150,Bajaj

In [13]:
df.head(10) #for top 10 data in a file

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000,Ahmedabad,17654,First Owner,3,110,TVS
1,Royal Enfield Classic 350cc,119900,Delhi,11000,First Owner,4,350,Royal Enfield
2,Triumph Daytona 675R,600000,Delhi,110,First Owner,8,675,Triumph
3,TVS Apache RTR 180cc,65000,Bangalore,16329,First Owner,4,180,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000,Bangalore,10000,First Owner,3,150,Yamaha
5,Yamaha FZs 150cc,53499,Delhi,25000,First Owner,6,150,Yamaha
6,Honda CB Hornet 160R ABS DLX,85000,Delhi,8200,First Owner,3,160,Honda
7,Hero Splendor Plus Self Alloy 100cc,45000,Delhi,12645,First Owner,3,100,Hero
8,Royal Enfield Thunderbird X 350cc,145000,Bangalore,9190,First Owner,3,350,Royal Enfield
9,Royal Enfield Classic Desert Storm 500cc,88000,Delhi,19000,Second Owner,7,500,Royal Enfield

In [18]:
df.tail(10)  # to acess the bottom item

,bike_name,price,city,kms_driven,owner,age,power,brand
32638,Yamaha Fazer 25 250cc,123000,Kadapa,14500,First Owner,4,250,Yamaha
32639,Royal Enfield Classic 350cc,95500,Delhi,18000,First Owner,8,350,Royal Enfield
32640,Hero Passion Pro 100cc,32000,Delhi,12000,First Owner,6,100,Hero
32641,Bajaj Avenger 220cc,41000,Delhi,20245,Second Owner,11,220,Bajaj
32642,Hero Passion 100cc,15000,Perumbavoor,35000,Second Owner,19,100,Hero
32643,Hero Passion Pro 100cc,39000,Delhi,22000,First Owner,4,100,Hero
32644,TVS Apache RTR 180cc,30000,Karnal,6639,First Owner,9,180,TVS
32645,Bajaj Avenger Street 220,60000,Delhi,20373,First Owner,6,220,Bajaj
32646,Hero Super Splendor 125cc,15600,Jaipur,84186,First Owner,16,125,Hero
32647,Bajaj Pulsar 150cc,22000,Pune,60857,First Owner,13,150,Bajaj

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32648 entries, 0 to 32647
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   32648 non-null  object
 1   price       32648 non-null  int64
 2   city        32648 non-null  object
 3   kms_driven  32648 non-null  int64
 4   owner       32648 non-null  object
 5   age         32648 non-null  int64
 6   power       32648 non-null  int64
 7   brand       32648 non-null  object
dtypes: int64(4), object(4)
memory usage: 2.0+ MB

In [19]:
df.dtypes

bike_name     object
price          int64
city          object
kms_driven     int64
owner         object
age            int64
power          int64
brand         object
dtype: object

In [20]:
df['age'].dtypes  # to check a data type for a specific column

dtype('int64')

In [21]:
df.shape  # it tell about how much row and column in a files/dataframe

(32648, 8)

In [22]:
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000,Ahmedabad,17654,First Owner,3,110,TVS
1,Royal Enfield Classic 350cc,119900,Delhi,11000,First Owner,4,350,Royal Enfield
2,Triumph Daytona 675R,600000,Delhi,110,First Owner,8,675,Triumph
3,TVS Apache RTR 180cc,65000,Bangalore,16329,First Owner,4,180,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000,Bangalore,10000,First Owner,3,150,Yamaha
...,...,...,...,...,...,...,...,...
32643,Hero Passion Pro 100cc,39000,Delhi,22000,First Owner,4,100,Hero
32644,TVS Apache RTR 180cc,30000,Karnal,6639,First Owner,9,180,TVS
32645,Bajaj Avenger Street 220,60000,Delhi,20373,First Owner,6,220,Bajaj
32646,Hero Super Splendor 125cc,15600,Jaipur,84186,First Owner,16,125,Hero
32647,Bajaj Pulsar 150cc,22000,Pune,60857,First Owner,13,150,Bajaj

In [26]:
df.duplicated().sum()  # to check that a entry is duplicated or not in dataframe 
# sum  function is use to give the total number of duplicated item

25324

In [27]:
df.drop_duplicates() # drop function is use to remove a duplicate item in data frame

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000,Ahmedabad,17654,First Owner,3,110,TVS
1,Royal Enfield Classic 350cc,119900,Delhi,11000,First Owner,4,350,Royal Enfield
2,Triumph Daytona 675R,600000,Delhi,110,First Owner,8,675,Triumph
3,TVS Apache RTR 180cc,65000,Bangalore,16329,First Owner,4,180,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000,Bangalore,10000,First Owner,3,150,Yamaha
...,...,...,...,...,...,...,...,...
9362,Hero Hunk Rear Disc 150cc,25000,Delhi,48587,First Owner,8,150,Hero
9369,Bajaj Avenger 220cc,35000,Bangalore,60000,First Owner,9,220,Bajaj
9370,Harley-Davidson Street 750 ABS,450000,Jodhpur,3430,First Owner,4,750,Harley-Davidson
9371,Bajaj Dominar 400 ABS,139000,Hyderabad,21300,First Owner,4,400,Bajaj
9372,Bajaj Avenger Street 220,80000,Hyderabad,7127,First Owner,5,220,Bajaj

In [28]:
df.shape

(32648, 8)

In [32]:
df.drop_duplicates(inplace=True)  # inplace function is used to aaply a any function in a original data frame

In [33]:
df.shape

(7324, 8)

In [35]:
df['brand'].nunique() # nunique tell about no of unique brand

23

In [36]:
df['brand'].unique()

array(['TVS', 'Royal Enfield', 'Triumph', 'Yamaha', 'Honda', 'Hero',
       'Bajaj', 'Suzuki', 'Benelli', 'KTM', 'Mahindra', 'Kawasaki',
       'Ducati', 'Hyosung', 'Harley-Davidson', 'Jawa', 'BMW', 'Indian',
       'Rajdoot', 'LML', 'Yezdi', 'MV', 'Ideal'], dtype=object)

In [38]:
df['brand'].value_counts() # value_counts is used to count a number of item in that particular column

brand
Bajaj              2081
Royal Enfield      1346
Hero               1142
Honda               676
Yamaha              651
TVS                 481
KTM                 375
Suzuki              203
Harley-Davidson      91
Kawasaki             61
Hyosung              53
Mahindra             50
Benelli              46
Triumph              21
Ducati               20
BMW                  10
Jawa                  7
Indian                3
MV                    3
Rajdoot               1
LML                   1
Yezdi                 1
Ideal                 1
Name: count, dtype: int64

In [44]:
df['city'].value_counts()

city
Delhi             1426
Bangalore          683
Mumbai             609
Gurgaon            474
Faridabad          463
                  ...
Muzaffarnagar        1
Calicut              1
Raigarh              1
Chikkaballapur       1
Sidhi                1
Name: count, Length: 443, dtype: int64

In [46]:
##########3__________________filtering operation________________________

In [50]:
df[df['brand'] == "Royal Enfield"]  #filtering operation is used to filter  a particular data of a column

,bike_name,price,city,kms_driven,owner,age,power,brand
1,Royal Enfield Classic 350cc,119900,Delhi,11000,First Owner,4,350,Royal Enfield
8,Royal Enfield Thunderbird X 350cc,145000,Bangalore,9190,First Owner,3,350,Royal Enfield
9,Royal Enfield Classic Desert Storm 500cc,88000,Delhi,19000,Second Owner,7,500,Royal Enfield
23,Royal Enfield Classic Chrome 500cc,121700,Kalyan,24520,First Owner,5,500,Royal Enfield
36,Royal Enfield Classic 350cc,98800,Kochi,39000,First Owner,5,350,Royal Enfield
...,...,...,...,...,...,...,...,...
9261,Royal Enfield Classic 500cc,146006,Guwahati,8575,First Owner,4,500,Royal Enfield
9319,Royal Enfield Classic 350cc,100000,Chennai,25000,First Owner,10,350,Royal Enfield
9337,Royal Enfield Himalayan 410cc,120000,Gurgaon,8492,First Owner,5,410,Royal Enfield
9338,Royal Enfield Himalayan 410cc,138000,Delhi,5000,First Owner,5,410,Royal Enfield
9344,Royal Enfield Bullet Twinspark 350cc,80000,Delhi,56968,First Owner,8,350,Royal Enfield

In [52]:
bullet = df[df['brand'] == "Royal Enfield"]

In [53]:
bullet

,bike_name,price,city,kms_driven,owner,age,power,brand
1,Royal Enfield Classic 350cc,119900,Delhi,11000,First Owner,4,350,Royal Enfield
8,Royal Enfield Thunderbird X 350cc,145000,Bangalore,9190,First Owner,3,350,Royal Enfield
9,Royal Enfield Classic Desert Storm 500cc,88000,Delhi,19000,Second Owner,7,500,Royal Enfield
23,Royal Enfield Classic Chrome 500cc,121700,Kalyan,24520,First Owner,5,500,Royal Enfield
36,Royal Enfield Classic 350cc,98800,Kochi,39000,First Owner,5,350,Royal Enfield
...,...,...,...,...,...,...,...,...
9261,Royal Enfield Classic 500cc,146006,Guwahati,8575,First Owner,4,500,Royal Enfield
9319,Royal Enfield Classic 350cc,100000,Chennai,25000,First Owner,10,350,Royal Enfield
9337,Royal Enfield Himalayan 410cc,120000,Gurgaon,8492,First Owner,5,410,Royal Enfield
9338,Royal Enfield Himalayan 410cc,138000,Delhi,5000,First Owner,5,410,Royal Enfield
9344,Royal Enfield Bullet Twinspark 350cc,80000,Delhi,56968,First Owner,8,350,Royal Enfield

In [54]:
df['owner'].nunique()

4

In [55]:
df['owner'].unique()

array(['First Owner', 'Second Owner', 'Third Owner',
       'Fourth Owner Or More'], dtype=object)

In [56]:
df['owner'].value_counts()

owner
First Owner             6642
Second Owner             588
Third Owner               84
Fourth Owner Or More      10
Name: count, dtype: int64

In [57]:
df[df['owner'] == "Third Owner"]

,bike_name,price,city,kms_driven,owner,age,power,brand
103,Bajaj Pulsar 150cc,11100,Pune,12000,Third Owner,12,150,Bajaj
225,KTM RC 200cc,113000,Kottayam,28000,Third Owner,6,200,KTM
284,Triumph Street Triple ABS 675cc,599999,Mumbai,7800,Third Owner,5,675,Triumph
364,Kawasaki Ninja 250cc,125000,Coimbatore,21000,Third Owner,11,250,Kawasaki
474,Mahindra Centuro Rockstar 110cc,18999,Pune,38669,Third Owner,6,110,Mahindra
...,...,...,...,...,...,...,...,...
8676,Royal Enfield Classic Desert Storm 500cc,92000,Ludhiana,23569,Third Owner,7,500,Royal Enfield
8791,Bajaj Pulsar 220F,21305,Ahmedabad,60000,Third Owner,11,220,Bajaj
8876,Yamaha FZ16 150cc,65000,Rajkot,18000,Third Owner,8,150,Yamaha
9183,Royal Enfield Thunderbird 350cc,35800,Bangalore,90408,Third Owner,18,350,Royal Enfield
9350,Bajaj Pulsar NS200,46000,Bangalore,27687,Third Owner,9,200,Bajaj

In [58]:
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000,Ahmedabad,17654,First Owner,3,110,TVS
1,Royal Enfield Classic 350cc,119900,Delhi,11000,First Owner,4,350,Royal Enfield
2,Triumph Daytona 675R,600000,Delhi,110,First Owner,8,675,Triumph
3,TVS Apache RTR 180cc,65000,Bangalore,16329,First Owner,4,180,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000,Bangalore,10000,First Owner,3,150,Yamaha
...,...,...,...,...,...,...,...,...
9362,Hero Hunk Rear Disc 150cc,25000,Delhi,48587,First Owner,8,150,Hero
9369,Bajaj Avenger 220cc,35000,Bangalore,60000,First Owner,9,220,Bajaj
9370,Harley-Davidson Street 750 ABS,450000,Jodhpur,3430,First Owner,4,750,Harley-Davidson
9371,Bajaj Dominar 400 ABS,139000,Hyderabad,21300,First Owner,4,400,Bajaj
9372,Bajaj Avenger Street 220,80000,Hyderabad,7127,First Owner,5,220,Bajaj

In [62]:
df[(df['brand'] =="Royal Enfield")  &  (df['age']<=4)  &     (df['owner'] == "First Owner") ]  ### in this case we filter data from different different condition .....

,bike_name,price,city,kms_driven,owner,age,power,brand
1,Royal Enfield Classic 350cc,119900,Delhi,11000,First Owner,4,350,Royal Enfield
8,Royal Enfield Thunderbird X 350cc,145000,Bangalore,9190,First Owner,3,350,Royal Enfield
38,Royal Enfield Thunderbird X 500cc,190500,Samastipur,4550,First Owner,2,500,Royal Enfield
73,Royal Enfield Thunderbird X 350cc,150000,Bangalore,15000,First Owner,3,350,Royal Enfield
77,Royal Enfield Thunderbird 350cc,115000,Bangalore,23700,First Owner,4,350,Royal Enfield
...,...,...,...,...,...,...,...,...
8825,Royal Enfield Bullet 350cc,130000,Gurgaon,18832,First Owner,4,350,Royal Enfield
8836,Royal Enfield Thunderbird X 350cc ABS,170200,Mumbai,1000,First Owner,2,350,Royal Enfield
8839,Royal Enfield Classic Desert Storm 500cc,160000,Noida,1754,First Owner,4,500,Royal Enfield
9245,Royal Enfield Classic 350cc,105000,Delhi,14779,First Owner,4,350,Royal Enfield
9261,Royal Enfield Classic 500cc,146006,Guwahati,8575,First Owner,4,500,Royal Enfield

In [63]:
 bullet2  = df[(df['brand'] =="Royal Enfield")  &  (df['age']<=4)  &     (df['owner'] == "First Owner") ]

In [64]:
bullet2

,bike_name,price,city,kms_driven,owner,age,power,brand
1,Royal Enfield Classic 350cc,119900,Delhi,11000,First Owner,4,350,Royal Enfield
8,Royal Enfield Thunderbird X 350cc,145000,Bangalore,9190,First Owner,3,350,Royal Enfield
38,Royal Enfield Thunderbird X 500cc,190500,Samastipur,4550,First Owner,2,500,Royal Enfield
73,Royal Enfield Thunderbird X 350cc,150000,Bangalore,15000,First Owner,3,350,Royal Enfield
77,Royal Enfield Thunderbird 350cc,115000,Bangalore,23700,First Owner,4,350,Royal Enfield
...,...,...,...,...,...,...,...,...
8825,Royal Enfield Bullet 350cc,130000,Gurgaon,18832,First Owner,4,350,Royal Enfield
8836,Royal Enfield Thunderbird X 350cc ABS,170200,Mumbai,1000,First Owner,2,350,Royal Enfield
8839,Royal Enfield Classic Desert Storm 500cc,160000,Noida,1754,First Owner,4,500,Royal Enfield
9245,Royal Enfield Classic 350cc,105000,Delhi,14779,First Owner,4,350,Royal Enfield
9261,Royal Enfield Classic 500cc,146006,Guwahati,8575,First Owner,4,500,Royal Enfield

In [66]:
df[(df['price']<65000) & (df['owner']=="Second Owner") & (df['age']<=3) & (df['brand']=="Bajaj")]

,bike_name,price,city,kms_driven,owner,age,power,brand
327,Bajaj Avenger Cruise 220,55250,Pune,7781,Second Owner,3,220,Bajaj
5852,Bajaj Avenger Street 220 ABS,45000,Chennai,35000,Second Owner,2,220,Bajaj

In [70]:
bullet2.to_csv('filter_data.csv',index=False)   ## in this case we store bullet2 data in csv file.....

In [75]:
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000,Ahmedabad,17654,First Owner,3,110,TVS
1,Royal Enfield Classic 350cc,119900,Delhi,11000,First Owner,4,350,Royal Enfield
2,Triumph Daytona 675R,600000,Delhi,110,First Owner,8,675,Triumph
3,TVS Apache RTR 180cc,65000,Bangalore,16329,First Owner,4,180,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000,Bangalore,10000,First Owner,3,150,Yamaha
...,...,...,...,...,...,...,...,...
9362,Hero Hunk Rear Disc 150cc,25000,Delhi,48587,First Owner,8,150,Hero
9369,Bajaj Avenger 220cc,35000,Bangalore,60000,First Owner,9,220,Bajaj
9370,Harley-Davidson Street 750 ABS,450000,Jodhpur,3430,First Owner,4,750,Harley-Davidson
9371,Bajaj Dominar 400 ABS,139000,Hyderabad,21300,First Owner,4,400,Bajaj
9372,Bajaj Avenger Street 220,80000,Hyderabad,7127,First Owner,5,220,Bajaj

In [84]:
df[(df['brand'] == "TVS") | (df['brand']=="Hero") | (df['brand']=="Bajaj")|(df['brand']== "Yamaha")]

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000,Ahmedabad,17654,First Owner,3,110,TVS
3,TVS Apache RTR 180cc,65000,Bangalore,16329,First Owner,4,180,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000,Bangalore,10000,First Owner,3,150,Yamaha
5,Yamaha FZs 150cc,53499,Delhi,25000,First Owner,6,150,Yamaha
7,Hero Splendor Plus Self Alloy 100cc,45000,Delhi,12645,First Owner,3,100,Hero
...,...,...,...,...,...,...,...,...
9361,Bajaj Avenger 220cc,50000,Bangalore,29134,First Owner,7,220,Bajaj
9362,Hero Hunk Rear Disc 150cc,25000,Delhi,48587,First Owner,8,150,Hero
9369,Bajaj Avenger 220cc,35000,Bangalore,60000,First Owner,9,220,Bajaj
9371,Bajaj Dominar 400 ABS,139000,Hyderabad,21300,First Owner,4,400,Bajaj
9372,Bajaj Avenger Street 220,80000,Hyderabad,7127,First Owner,5,220,Bajaj

In [81]:
df.drop(['bike_name'],axis = 'columns')  ## drop function is use to delete a rows and columns

       price       city  kms_driven        owner  age  power            brand
0      35000  Ahmedabad       17654  First Owner    3    110              TVS
1     119900      Delhi       11000  First Owner    4    350    Royal Enfield
2     600000      Delhi         110  First Owner    8    675          Triumph
3      65000  Bangalore       16329  First Owner    4    180              TVS
4      80000  Bangalore       10000  First Owner    3    150           Yamaha
...      ...        ...         ...          ...  ...    ...              ...
9362   25000      Delhi       48587  First Owner    8    150             Hero
9369   35000  Bangalore       60000  First Owner    9    220            Bajaj
9370  450000    Jodhpur        3430  First Owner    4    750  Harley-Davidson
9371  139000  Hyderabad       21300  First Owner    4    400            Bajaj
9372   80000  Hyderabad        7127  First Owner    5    220            Bajaj

[7324 rows x 7 columns]

In [88]:
df.drop('price',axis= 'columns')
# axis => rows, columns
# rows => 0
# columns => 1

,bike_name,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,Ahmedabad,17654,First Owner,3,110,TVS
1,Royal Enfield Classic 350cc,Delhi,11000,First Owner,4,350,Royal Enfield
2,Triumph Daytona 675R,Delhi,110,First Owner,8,675,Triumph
3,TVS Apache RTR 180cc,Bangalore,16329,First Owner,4,180,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,Bangalore,10000,First Owner,3,150,Yamaha
...,...,...,...,...,...,...,...
9362,Hero Hunk Rear Disc 150cc,Delhi,48587,First Owner,8,150,Hero
9369,Bajaj Avenger 220cc,Bangalore,60000,First Owner,9,220,Bajaj
9370,Harley-Davidson Street 750 ABS,Jodhpur,3430,First Owner,4,750,Harley-Davidson
9371,Bajaj Dominar 400 ABS,Hyderabad,21300,First Owner,4,400,Bajaj
9372,Bajaj Avenger Street 220,Hyderabad,7127,First Owner,5,220,Bajaj

In [97]:
df

       price       city  kms_driven  age  power            brand
0      35000  Ahmedabad       17654    3    110              TVS
1     119900      Delhi       11000    4    350    Royal Enfield
2     600000      Delhi         110    8    675          Triumph
3      65000  Bangalore       16329    4    180              TVS
4      80000  Bangalore       10000    3    150           Yamaha
...      ...        ...         ...  ...    ...              ...
9362   25000      Delhi       48587    8    150             Hero
9369   35000  Bangalore       60000    9    220            Bajaj
9370  450000    Jodhpur        3430    4    750  Harley-Davidson
9371  139000  Hyderabad       21300    4    400            Bajaj
9372   80000  Hyderabad        7127    5    220            Bajaj

[7324 rows x 6 columns]